robotics-at-maryland/qubo/embedded/drivers/tivaware/examples/boards/ek-tm4c1294xl-boostxl-battpack/boostxl_battpack/boostxl_battpack.c
//*****************************************************************************
//
// boostxl_battpack.c - Example for use with the Fuel Tank BoosterPack
//                      (BOOSTXL-BATTPACK)
//
// Copyright (c) 2013-2016 Texas Instruments Incorporated.  All rights reserved.
// Software License Agreement
// 
// Texas Instruments (TI) is supplying this software for use solely and
// exclusively on TI's microcontroller products. The software is owned by
// TI and/or its suppliers, and is protected under applicable copyright
// laws. You may not combine this software with "viral" open-source
// software in order to form a larger program.
// 
// THIS SOFTWARE IS PROVIDED "AS IS" AND WITH ALL FAULTS.
// NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING, BUT
// NOT LIMITED TO, IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE. TI SHALL NOT, UNDER ANY
// CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL, OR CONSEQUENTIAL
// DAMAGES, FOR ANY REASON WHATSOEVER.
// 
// This is part of revision 2.1.3.156 of the EK-TM4C1294XL Firmware Package.
//
//*****************************************************************************

#include <stdint.h>
#include <stdbool.h>
#include <math.h>
#include "inc/hw_memmap.h"
#include "inc/hw_types.h"
#include "inc/hw_ints.h"
#include "inc/hw_gpio.h"
#include "driverlib/debug.h"
#include "driverlib/gpio.h"
#include "driverlib/interrupt.h"
#include "driverlib/pin_map.h"
#include "driverlib/rom.h"
#include "driverlib/rom_map.h"
#include "driverlib/sysctl.h"
#include "driverlib/systick.h"
#include "driverlib/timer.h"
#include "driverlib/uart.h"
#include "utils/ustdlib.h"
#include "utils/cmdline.h"
#include "utils/uartstdio.h"
#include "sensorlib/i2cm_drv.h"
#include "sensorlib/bq27510g3.h"
#include "sensorlib/hw_bq27510g3.h"
#include "drivers/pinout.h"
#include "drivers/buttons.h"

//*****************************************************************************
//
//! \addtogroup example_list
//! <h1>Fuel Tank BoosterPack Measurement Example Application
//! (boostxl_battpack)</h1>
//!
//! This example demonstrates the basic use of the Sensor Library, TM4C1294XL
//! LaunchPad and the Fuel Tank BoosterPack to obtain state-of-charge,
//! battery voltage, temperature, and several other supported  measurements
//! via the BQ27510G3 gas gauge sensor on the Fuel tank boosterpack.
//!
//! The LEDs on the LaunchPad will blink while the application is running.
//!
//! The Fuel Tank BoosterPack (BOOSTXL-BATTPACK) defaults to be installed on
//! the BoosterPack 2 interface headers.
//!
//! Instructions for use of Fuel Tank on BoosterPack 1 headers are in the code
//! comments.
//!
//! If you would like to observe how the application affects the voltage or
//! current readings from the battery, please ensure the POWER_SELECT (JP1)
//! jumper on the EK-TM4C1294XL LaunchPad is configured for "BoosterPack".
//!
//! Connect a serial terminal program to the LaunchPad's ICDI virtual serial
//! port at 115,200 baud.  Use eight bits per byte, no parity and one stop bit.
//! The raw sensor measurements are printed to the terminal.
//
//*****************************************************************************

//*****************************************************************************
//
// Define BQ27510G3 I2C Address.
//
//*****************************************************************************
#define BQ27510G3_I2C_ADDRESS      0x55

//*****************************************************************************
//
// Global instance structure for the I2C master driver.
//
//*****************************************************************************
tI2CMInstance g_sI2CInst;

//*****************************************************************************
//
// Global variable to hold the actual system clock speed.
//
//*****************************************************************************
uint32_t g_ui32SysClock;

//*****************************************************************************
//
// Global instance structure for the BQ27510G3 sensor driver.
//
//*****************************************************************************
tBQ27510G3 g_sBQ27510G3Inst;

//*****************************************************************************
//
// Global new data flag to alert main that BQ27510G3 data is ready.
//
//*****************************************************************************
volatile uint_fast8_t g_vui8DataFlag;

//*****************************************************************************
//
// Global new error flag to store the error condition if encountered.
//
//*****************************************************************************
volatile uint_fast8_t g_vui8ErrorFlag;

//*****************************************************************************
//
// Defines the size of the buffer that holds the command line.
//
//*****************************************************************************
#define CMD_BUF_SIZE    64

//*****************************************************************************
//
// Global buffer that holds the command line.
//
//*****************************************************************************
static char g_cCmdBuf[CMD_BUF_SIZE];

//*****************************************************************************
//
// BQ27510G3 Sensor callback function.  Called at the end of BQ27510G3 sensor
// driver transactions. This is called from I2C interrupt context. Therefore,
// we just set a flag and let main do the bulk of the computations and display.
//
//*****************************************************************************
void BQ27510G3AppCallback(void* pvCallbackData, uint_fast8_t ui8Status)
{
    if(ui8Status == I2CM_STATUS_SUCCESS)
    {
        //
        // If I2C transaction is successful, set data ready flag.
        //
        g_vui8DataFlag = 1;
    }
    else
    {
        //
        // If I2C transaction fails, set error flag.
        //
        g_vui8ErrorFlag = ui8Status;
    }
}

//*****************************************************************************
//
// Called by the NVIC as a result of I2C8 Interrupt. I2C8 is the I2C connection
// to the BQ27510G3 fuel guage.
//
// This handler is installed in the vector table for I2C8 by default.  To use
// the Fuel Tank on BoosterPack 1 interface change the startup file to place
// this interrupt in I2C7 vector location.
//
//*****************************************************************************
void
BQ27510G3I2CIntHandler(void)
{
    //
    // Pass through to the I2CM interrupt handler provided by sensor library.
    // This is required to be at application level so that I2CMIntHandler can
    // receive the instance structure pointer as an argument.
    //
    I2CMIntHandler(&g_sI2CInst);
}

//*****************************************************************************
//
// The interrupt handler for the timer used to pace the animation.
//
//*****************************************************************************
void
LEDBlinkIntHandler(void)
{
    uint32_t ui32LEDState;

    //
    // Clear the timer interrupt.
    //
    ROM_TimerIntClear(TIMER2_BASE, TIMER_TIMA_TIMEOUT);

    //
    // Increment LED states in circular pattern
    //
    LEDRead(&ui32LEDState);

    //
    // Case statements for thermometer pattern
    //
    LEDWrite(CLP_D1 | CLP_D2 | CLP_D3| CLP_D4,
       ui32LEDState == 0 ? CLP_D1 :                                     \
       ui32LEDState == CLP_D1 ? (CLP_D1 | CLP_D2) :                     \
       ui32LEDState == (CLP_D1 | CLP_D2) ? (CLP_D1 | CLP_D2 | CLP_D3) : \
       ui32LEDState == (CLP_D1 | CLP_D2 | CLP_D3) ?                     \
                                (CLP_D1 | CLP_D2 | CLP_D3 | CLP_D4) :   \
       ui32LEDState == (CLP_D1 | CLP_D2 | CLP_D3 | CLP_D4) ? 0 : CLP_D1);

