robotics-at-maryland/qubo/embedded/drivers/tivaware/examples/boards/ek-tm4c1294xl-boostxl-battpack/boostxl_battpack/boostxl_battpack.c
}

//*****************************************************************************
//
// Function to wait for the BQ27510G3 transactions to complete.
//
//*****************************************************************************
uint_fast8_t
BQ27510G3AppI2CWait(void)
{
    uint_fast8_t ui8RC = 0;

    //
    // Put the processor to sleep while we wait for the I2C driver to
    // indicate that the transaction is complete.
    //
    while((g_vui8DataFlag == 0) && (g_vui8ErrorFlag ==0))
    {
        //
        // Wait for I2C Transactions to complete.
        //
    }

    //
    // If an error occurred call the error handler immediately.
    //
    if(g_vui8ErrorFlag)
    {
        UARTprintf("\033[31;1m");
        UARTprintf("I2C Error!\n\n");
        UARTprintf("Please ensure FuelTank BP is installed correctly\n");
        UARTprintf("and is sufficiently charged for minimum functionality.\n");
        UARTprintf("\033[0m");
        ui8RC = g_vui8ErrorFlag;
    }

    //
    // Clear the data flags for next use.
    //
    g_vui8DataFlag = 0;
    g_vui8ErrorFlag = 0;

    //
    // Return original error code to caller.
    //
    return ui8RC;
}

//*****************************************************************************
//
// Prompts the user for a command, and blocks while waiting for the user's
// input. This function will return after the execution of a single command.
//
//*****************************************************************************
void
CheckForUserCommands(void)
{
    int iStatus;

    //
    // Peek to see if a full command is ready for processing.
    //
    if(UARTPeek('\r') == -1)
    {
        //
        // If not, return so other functions get a chance to run.
        //
        return;
    }

    //
    // If we do have commands, process them immediately in the order they were
    // received.
    //
    while(UARTPeek('\r') != -1)
    {
        //
        // Get a user command back.
        //
        UARTgets(g_cCmdBuf, sizeof(g_cCmdBuf));

        //
        // Process the received command.
        //
        iStatus = CmdLineProcess(g_cCmdBuf);

        //
        // Handle the case of bad command.
        //
        if(iStatus == CMDLINE_BAD_CMD)
        {
            UARTprintf("Bad command! Type 'h' for help!\n");
        }

        //
        // Handle the case of too many arguments.
        //
        else if(iStatus == CMDLINE_TOO_MANY_ARGS)
        {
            UARTprintf("Too many arguments for command processor!\n");
        }
    }

    //
    // Print the prompt.
    //
    UARTprintf("\nBattpack> ");
}

//*****************************************************************************
//
// This function implements the "Cmd_temp" command.
// This function displays the current temp of the battery boosterpack
//
//*****************************************************************************
int
Cmd_temp(int argc, char *argv[])
{
    float fTemperature;
    uint_fast8_t ui8Status;
    int32_t i32IntegerPart;
    int32_t i32FractionPart;

    UARTprintf("\nPolling Temperature, press any key to stop\n\n");

    while(1)
    {
    	//
        // Detect if any key has been pressed.
        //
        if(UARTRxBytesAvail() > 0)
        {
        	UARTFlushRx();
        	break;
        }

        //
        // Get the raw data from the sensor over the I2C bus.
        //
        BQ27510G3DataRead(&g_sBQ27510G3Inst, BQ27510G3AppCallback,
                          &g_sBQ27510G3Inst);

        //
        // Wait for callback to indicate request is complete.
        //
        ui8Status = BQ27510G3AppI2CWait();

        //
        // If initial read is not successful, exit w/o trying other reads.
        //
        if(ui8Status != 0)
        {
            return(0);
        }

        //
        // Call routine to retrieve data in float format.
        //
        BQ27510G3DataTemperatureInternalGetFloat(&g_sBQ27510G3Inst,
                                                 &fTemperature);

        //
        // Convert the temperature to an integer part and fraction part for
        // easy print.
        //
        i32IntegerPart = (int32_t) fTemperature;
        i32FractionPart =(int32_t) (fTemperature * 1000.0f);
        i32FractionPart = i32FractionPart - (i32IntegerPart * 1000);
        if(i32FractionPart < 0)
        {
            i32FractionPart *= -1;
        }

        //
        // Print temperature with one digit of decimal precision.
        //
        UARTprintf("Current Temperature: \t%3d.%01d C\t\t", i32IntegerPart,
                i32FractionPart);

        //
        // Print new line.
        //
        UARTprintf("\n");

        //
        // Delay for one second. This is to keep sensor duty cycle
        // to about 10% as suggested in the datasheet, section 2.4.
        // This minimizes self heating effects and keeps reading more accurate.
        //
        ROM_SysCtlDelay(g_ui32SysClock / 3);
    }

    //
    // Return success.
    //
    return(0);
}

//*****************************************************************************
//
// This function implements the "Cmd_volt" command.
// This function displays the current battery voltage of the battery
// boosterpack.
//
//*****************************************************************************
int
Cmd_volt(int argc, char *argv[])
{
    float fData;
    uint_fast8_t ui8Status;
    int32_t i32IntegerPart;
    int32_t i32FractionPart;

    UARTprintf("\nPolling battery voltage, press any key to stop\n\n");

    while(1)
    {
    	//
        // Detect if any key has been pressed.
        //
        if(UARTRxBytesAvail() > 0)
        {
        	UARTFlushRx();
        	break;
        }

        //
        // Get the raw data from the sensor over the I2C bus.
        //
        BQ27510G3DataRead(&g_sBQ27510G3Inst, BQ27510G3AppCallback,
                          &g_sBQ27510G3Inst);

        //
        // Wait for callback to indicate request is complete.
        //
        ui8Status = BQ27510G3AppI2CWait();

        //
        // If initial read is not successful, exit w/o trying other reads.
        //
        if(ui8Status != 0)
        {
            return(0);
        }

        //
        // Call routine to retrieve data in float format.
        //
        BQ27510G3DataVoltageBatteryGetFloat(&g_sBQ27510G3Inst, &fData);

        //
        // Convert the data to an integer part and fraction part for easy
        // print.
        //
        i32IntegerPart = (int32_t) fData;
        i32FractionPart =(int32_t) (fData * 1000.0f);
        i32FractionPart = i32FractionPart - (i32IntegerPart * 1000);
        if(i32FractionPart < 0)
        {
            i32FractionPart *= -1;
        }

        //
        // Print voltage with one digit of decimal precision.
        //
        UARTprintf("Battery Voltage: \t%3d.%01d V\t\t", i32IntegerPart,
                i32FractionPart);

        //
        // Print new line.
        //
        UARTprintf("\n");

        //
        // Delay for one second. This is to keep sensor duty cycle
        // to about 10% as suggested in the datasheet, section 2.4.
        // This minimizes self heating effects and keeps reading more accurate.
        //
        ROM_SysCtlDelay(g_ui32SysClock / 8);
    }

    //
    // Return success.
    //
    return(0);
}

//*****************************************************************************
//
// This function implements the "Cmd_current" command.
// This function displays the battery current to/from the battery boosterpack
//
//*****************************************************************************
int
Cmd_current(int argc, char *argv[])
{
    float fData;
    uint_fast8_t ui8Status;
    int32_t i32IntegerPart;
    int32_t i32FractionPart;

    UARTprintf("\nPolling battery current, press any key to stop\n\n");

    while(1)
    {
    	//
        // Detect if any key has been pressed.
        //
        if(UARTRxBytesAvail() > 0)
        {
        	UARTFlushRx();
        	break;
        }

        //
        // Get the raw data from the sensor over the I2C bus
        //
        BQ27510G3DataRead(&g_sBQ27510G3Inst, BQ27510G3AppCallback,
                          &g_sBQ27510G3Inst);

        //
        // Wait for callback to indicate request is complete.
        //
        ui8Status = BQ27510G3AppI2CWait();

        //
        // If initial read is not successful, exit w/o trying other reads.
        //
        if(ui8Status != 0)
        {
            return(0);
        }

        //
        // Call routine to retrieve data in float format.
        //
        BQ27510G3DataCurrentInstantaneousGetFloat(&g_sBQ27510G3Inst, &fData);
        fData *= 1000.0f;

        //
        // Convert the data to an integer part and fraction part for easy
        // print.
        //
        i32IntegerPart = (int32_t) fData;
        i32FractionPart =(int32_t) (fData * 1000.0f);
        i32FractionPart = i32FractionPart - (i32IntegerPart * 1000);
        if(i32FractionPart < 0)
        {
            i32FractionPart *= -1;
        }

        //
        // Print voltage with one digit of decimal precision.
        //
        UARTprintf("Battery Current: \t%3d.%01d mA\t\t", i32IntegerPart,
                i32FractionPart);

        //
        // Print new line.
        //
        UARTprintf("\n");

        //
        // Delay for one second. This is to keep sensor duty cycle
        // to about 10% as suggested in the datasheet, section 2.4.
        // This minimizes self heating effects and keeps reading more accurate.
        //
        ROM_SysCtlDelay(g_ui32SysClock / 8);
    }

    //
    // Return success.
    //
    return(0);
}

//*****************************************************************************
//
// This function implements the "Cmd_charge" command.
// This function displays the remaining charge of the battery boosterpack
//
//*****************************************************************************
int
Cmd_charge(int argc, char *argv[])
{
    float fData;
    uint_fast8_t ui8Status;
    int32_t i32IntegerPart;
    int32_t i32FractionPart;

    UARTprintf("\nPolling remaining charge, press any key to stop\n\n");

    while(1)
    {
    	//
        // Detect if any key has been pressed.
        //
        if(UARTRxBytesAvail() > 0)
        {
        	UARTFlushRx();
        	break;
        }

        //
        // Get the raw data from the sensor over the I2C bus.
        //
        BQ27510G3DataRead(&g_sBQ27510G3Inst, BQ27510G3AppCallback,
                          &g_sBQ27510G3Inst);

        //
        // Wait for callback to indicate request is complete.
        //
        ui8Status = BQ27510G3AppI2CWait();

        //
        // If initial read is not successful, exit w/o trying other reads.
        //
        if(ui8Status != 0)
        {
            return(0);
        }

        //
        // Call routine to retrieve data in float format.
        //
        BQ27510G3DataChargeStateGetFloat(&g_sBQ27510G3Inst, &fData);

        //
        // Convert the data to an integer part and fraction part for easy
        // print.
        //
        i32IntegerPart = (int32_t) fData;
        i32FractionPart =(int32_t) (fData * 1000.0f);
        i32FractionPart = i32FractionPart - (i32IntegerPart * 1000);
        if(i32FractionPart < 0)
        {
            i32FractionPart *= -1;
        }

        //
        // Print SoC with one digit of decimal precision.
        //
        UARTprintf("State of Charge: \t%3d.%01d %%\t\t", i32IntegerPart,
                i32FractionPart);

        //
        // Print new line.
        //
        UARTprintf("\n");

        //
        // Delay for one second. This is to keep sensor duty cycle
        // to about 10% as suggested in the datasheet, section 2.4.
        // This minimizes self heating effects and keeps reading more accurate.
        //
        ROM_SysCtlDelay(g_ui32SysClock / 3);
    }

    //
    // Return success.
    //
    return(0);
}
//*****************************************************************************
//
// This function implements the "Cmd_health" command.
// This function displays the current health of the battery boosterpack
//
//*****************************************************************************
int
Cmd_health(int argc, char *argv[])
{
    float fData;
    uint_fast8_t ui8Status;
    int32_t i32IntegerPart;
    int32_t i32FractionPart;

    //
    // Get the raw data from the sensor over the I2C bus.
    //
    BQ27510G3DataRead(&g_sBQ27510G3Inst, BQ27510G3AppCallback,
                      &g_sBQ27510G3Inst);

    //
    // Wait for callback to indicate request is complete.
    //
    ui8Status = BQ27510G3AppI2CWait();

    //
    // If initial read is not successful, exit w/o trying other reads.
    //
    if(ui8Status != 0)
    {
        return(0);
    }

    //
    // Call routine to retrieve data in float format.
    //
    BQ27510G3DataHealthGetFloat(&g_sBQ27510G3Inst, &fData);

    //
    // Convert the data to an integer part and fraction part for easy
    // print.
    //
    i32IntegerPart = (int32_t) fData;
    i32FractionPart =(int32_t) (fData * 1000.0f);
    i32FractionPart = i32FractionPart - (i32IntegerPart * 1000);
    if(i32FractionPart < 0)
    {
        i32FractionPart *= -1;
    }

    //
    // Print health with one digit of decimal precision.
    //
    UARTprintf("State of Health: \t%3d.%01d %%\t\t", i32IntegerPart,
            i32FractionPart);

    //
    // Print new line.
    //
    UARTprintf("\n");

    //
    // Return success.
    //
    return(0);
}

//*****************************************************************************
//
// This function implements the "Cmd_status" command.
// This function displays all battery boosterpack status readings at once
//
//*****************************************************************************
int
Cmd_status(int argc, char *argv[])
{
    float fData;
    uint_fast8_t ui8Status;
    int32_t i32IntegerPart;
    int32_t i32FractionPart;
    int32_t i32Current;

    //
    // Get the raw data from the sensor over the I2C bus.
    //
    BQ27510G3DataRead(&g_sBQ27510G3Inst, BQ27510G3AppCallback,
                      &g_sBQ27510G3Inst);

    //
    // Wait for callback to indicate request is complete.
    //
    ui8Status = BQ27510G3AppI2CWait();

    //
    // If initial read is not successful, exit w/o trying other reads.
    //
    if(ui8Status != 0)
    {
        return(0);
    }

    //
    //*********  Capacity *********
    //

    //
    // Call routine to retrieve data in float format.
    //
    BQ27510G3DataCapacityFullAvailableGetFloat(&g_sBQ27510G3Inst, &fData);
    fData *= 1000.0f;

    //
    // Convert the float to an integer part and fraction part for easy
    // print.
    //
    i32IntegerPart = (int32_t) fData;
    i32FractionPart =(int32_t) (fData * 1000.0f);
    i32FractionPart = i32FractionPart - (i32IntegerPart * 1000);
    if(i32FractionPart < 0)
    {
        i32FractionPart *= -1;
    }

    //
    // Print capacity with 1 digits of decimal precision.
    //
    UARTprintf("Battery Capacity: \t%3d.%01d mAH\t\t", i32IntegerPart,
            i32FractionPart);

    //
    // Print new line.
    //
    UARTprintf("\n");

    //
    //********* Remaining Capacity *********
    //

    //
    // Call routine to retrieve data in float format.
    //
    BQ27510G3DataCapacityRemainingGetFloat(&g_sBQ27510G3Inst, &fData);
    fData *= 1000.0f;

    //
    // Convert the float to an integer part and fraction part for easy
    // print.
    //
    i32IntegerPart = (int32_t) fData;
    i32FractionPart =(int32_t) (fData * 1000.0f);
    i32FractionPart = i32FractionPart - (i32IntegerPart * 1000);
    if(i32FractionPart < 0)
    {
        i32FractionPart *= -1;
    }

    //
    // Print data with one digit of decimal precision.
    //
    UARTprintf("Remaining Capacity: \t%3d.%01d mAH\t\t", i32IntegerPart,
            i32FractionPart);

    //
    // Print new line.
    //
    UARTprintf("\n");

    //
    //*********  Voltage *********
    //

    //
    // Call routine to retrieve data in float format.
    //
    BQ27510G3DataVoltageBatteryGetFloat(&g_sBQ27510G3Inst, &fData);

    //
    // Convert the float to an integer part and fraction part for easy
    // print.
    //
    i32IntegerPart = (int32_t) fData;
    i32FractionPart =(int32_t) (fData * 1000.0f);
    i32FractionPart = i32FractionPart - (i32IntegerPart * 1000);
    if(i32FractionPart < 0)
    {
        i32FractionPart *= -1;
    }

    //
    // Print data with 1 digit of decimal precision.
    //
    UARTprintf("Battery Voltage: \t%3d.%01d V\t\t", i32IntegerPart,
            i32FractionPart);

    //
    // Print new line.
    //
    UARTprintf("\n");

    //
    //*********  Temperature *********
    //

    //
    // Call routine to retrieve data in float format.
    //
    BQ27510G3DataTemperatureInternalGetFloat(&g_sBQ27510G3Inst, &fData);

    //
    // Convert the float to an integer part and fraction part for easy
    // print.
    //
    i32IntegerPart = (int32_t) fData;
    i32FractionPart =(int32_t) (fData * 1000.0f);
    i32FractionPart = i32FractionPart - (i32IntegerPart * 1000);
    if(i32FractionPart < 0)
    {
        i32FractionPart *= -1;
    }

    //
    // Print temperature with one digits of decimal precision.
    //
    UARTprintf("Internal Temperature: \t%3d.%01d C\t\t", i32IntegerPart,
            i32FractionPart);

    //
    // Print new line.
    //
    UARTprintf("\n");

    //
    //********* State of Charge *********
    //

    //
    // Call routine to retrieve data in float format.
    //
    BQ27510G3DataChargeStateGetFloat(&g_sBQ27510G3Inst, &fData);

    //
    // Convert the float to an integer part and fraction part for easy
    // print.
    //
    i32IntegerPart = (int32_t) fData;
    i32FractionPart =(int32_t) (fData * 1000.0f);
    i32FractionPart = i32FractionPart - (i32IntegerPart * 1000);
    if(i32FractionPart < 0)
    {
        i32FractionPart *= -1;
    }

    //
    // Print data with one digit of decimal precision.
    //
    UARTprintf("State of Charge: \t%3d.%01d %%\t\t", i32IntegerPart,
            i32FractionPart);

    //
    // Print new line.
    //
    UARTprintf("\n");

    //
    //********* Health *********
    //

    //
    // Call routine to retrieve data in float format.
    //
    BQ27510G3DataHealthGetFloat(&g_sBQ27510G3Inst, &fData);

    //
    // Convert the float to an integer part and fraction part for easy
    // print.
    //
    i32IntegerPart = (int32_t) fData;
    i32FractionPart =(int32_t) (fData * 1000.0f);
    i32FractionPart = i32FractionPart - (i32IntegerPart * 1000);
    if(i32FractionPart < 0)
    {
        i32FractionPart *= -1;
    }

    //
    // Print data with one digit of decimal precision.
    //
    UARTprintf("State of Health: \t%3d.%01d %%\t\t", i32IntegerPart,
            i32FractionPart);

    //
    // Print new line.
    //
    UARTprintf("\n");

    //
    //********* Current *********
    //

    //
    // Call routine to retrieve data in float format.
    //
    BQ27510G3DataCurrentAverageGetFloat(&g_sBQ27510G3Inst, &fData);
    fData *= 1000.0f;

    //
    // Convert the float to an integer part and fraction part for easy
    // print.
    //
    i32IntegerPart = (int32_t) fData;
    i32FractionPart =(int32_t) (fData * 1000.0f);
    i32FractionPart = i32FractionPart - (i32IntegerPart * 1000);
    if(i32FractionPart < 0)
    {
        i32FractionPart *= -1;
    }

    i32Current = i32IntegerPart;

    //
    // Print data with one digit of decimal precision.
    //
    UARTprintf("Average Current: \t%3d.%01d mA\t\t", i32IntegerPart,
            i32FractionPart);

    //
    // Print new line.
    //
    UARTprintf("\n");

    //
    //********* Cycles *********
    //

    //
    // Call routine to retrieve data in float format.
    //
    BQ27510G3DataCycleCountGetFloat(&g_sBQ27510G3Inst, &fData);

    //
    // Convert the float to an integer part and fraction part for easy
    // print.
    //
    i32IntegerPart = (int32_t) fData;
    i32FractionPart =(int32_t) (fData * 1000.0f);
    i32FractionPart = i32FractionPart - (i32IntegerPart * 1000);
    if(i32FractionPart < 0)
    {
        i32FractionPart *= -1;
    }

    //
    // Print data with one digit of decimal precision.
    //
    UARTprintf("Recharge Cycles: \t%3d cyc\t\t", i32IntegerPart);

    //
    // Print new line.
    //
    UARTprintf("\n");

    //
    //********* Time to Empty *********
    //

    //
    // Call routine to retrieve data in float format.
    //
    BQ27510G3DataTimeToEmptyGetFloat(&g_sBQ27510G3Inst, &fData);

    //
    // Convert the float to an integer part and fraction part for easy
    // print.
    //
    i32IntegerPart = (int32_t) fData;
    i32FractionPart =(int32_t) (fData * 1000.0f);
    i32FractionPart = i32FractionPart - (i32IntegerPart * 1000);
    if(i32FractionPart < 0)
    {
        i32FractionPart *= -1;
    }

    //
    // Print data with one digit of decimal precision.
    //
    if(i32IntegerPart > 60)
    {
        UARTprintf("Time Until Empty: \t%3d hrs\t\t", i32IntegerPart/60);
    }
    else if (i32IntegerPart == -1)
    {
        UARTprintf("Time Until Empty: \t   NA\t\t");
    }
    else
    {
        UARTprintf("Time Until Empty: \t%3d min\t\t", i32IntegerPart);
    }

    //
    // Print new line.
    //
    UARTprintf("\n\n");

    if(i32Current > 0)
    {
        UARTprintf("The battery is charging!\r\n");
    }
    else
    {
        UARTprintf("The battery is discharging!\r\n");
    }
    //
    // Return success.
    //
    return(0);
}

//*****************************************************************************
//
// This function implements the "help" command.  It prints a simple list
// of the available commands with a brief description.
//
//*****************************************************************************
int
Cmd_help(int argc, char *argv[])
{
    tCmdLineEntry *pEntry;

    //
    // Print some header text.
    //
    UARTprintf("\nAvailable commands\n");
    UARTprintf("------------------\n");

    //
    // Point at the beginning of the command table.
    //
    pEntry = &g_psCmdTable[0];

    //
    // Enter a loop to read each entry from the command table.  The
    // end of the table has been reached when the command name is NULL.
    //
    while(pEntry->pcCmd)
    {
        //
        // Print the command name and the brief description.
        //
        UARTprintf("%s%s\n", pEntry->pcCmd, pEntry->pcHelp);

        //
        // Advance to the next entry in the table.
        //
        pEntry++;
    }

    //
    // Return success.
    //
    return(0);
}

