robotics-at-maryland/qubo/embedded/drivers/tivaware/examples/boards/ek-tm4c1294xl-boostxl-battpack/boostxl_battpack/boostxl_battpack.c
//*****************************************************************************
//
// This is the table that holds the command names, implementing functions,
// and brief description.
//
//*****************************************************************************
tCmdLineEntry g_psCmdTable[] =
{
    { "help",        Cmd_help, "      : Display list of commands" },
    { "h",           Cmd_help, "         : alias for help" },
    { "?",           Cmd_help, "         : alias for help" },
    { "s",           Cmd_status, "         : alias for status" },
    { "status",      Cmd_status, "    : Display all status" },
    { "health",      Cmd_health, "    : Display health" },
    { "charge",      Cmd_charge, "    : Poll remaining charge" },
    { "temp",        Cmd_temp, "      : Poll temperature" },
    { "volt",        Cmd_volt, "      : Poll battery voltage" },
    { "current",     Cmd_current, "   : Poll battery current" },
    { 0, 0, 0 }
};

//*****************************************************************************
//
// The error routine that is called if the driver library encounters an error.
//
//*****************************************************************************
#ifdef DEBUG
void
__error__(char *pcFilename, uint32_t ui32Line)
{
}
#endif

//*****************************************************************************
//
// Main 'C' Language entry point.
//
//*****************************************************************************
int
main(void)
{

    //
    // Configure the system frequency.
    //
    g_ui32SysClock = MAP_SysCtlClockFreqSet((SYSCTL_XTAL_25MHZ |
                                             SYSCTL_OSC_MAIN | SYSCTL_USE_PLL |
                                             SYSCTL_CFG_VCO_480), 120000000);

    //
    // Configure the device pins.
    //
    PinoutSet(false, false);

    //
    // Enable UART0
    //
    ROM_SysCtlPeripheralEnable(SYSCTL_PERIPH_UART0);

    //
    // Initialize the UART for console I/O.
    //
    UARTStdioConfig(0, 115200, g_ui32SysClock);

    //
    // Clear the terminal and print the welcome message.
    //
    UARTprintf("\033[2J\033[H");
    UARTprintf("Fuel Tank BoosterPack (BQ27510-G3) Example\n");
    UARTprintf("Type 'help' for a list of commands\n");
    UARTprintf("\nBattpack> ");

    //
    // Enable the timer peripherals for LED.
    //
    ROM_SysCtlPeripheralEnable(SYSCTL_PERIPH_TIMER2);

    //
    // Configure the timer used to pace the LEDs.
    //
    ROM_TimerConfigure(TIMER2_BASE, TIMER_CFG_PERIODIC);

    //
    // Set Timeouts which control speed of LED toggles
    //
    ROM_TimerLoadSet(TIMER2_BASE, TIMER_A, g_ui32SysClock);
    ROM_TimerEnable(TIMER2_BASE, TIMER_A);

    //
    // Setup the interrupts for the LED timer timeouts.
    //
    ROM_IntEnable(INT_TIMER2A);
    ROM_TimerIntEnable(TIMER2_BASE, TIMER_TIMA_TIMEOUT);

    //
    // The I2C8 peripheral must be enabled before use.
    //
    // For BoosterPack 1 interface change this to I2C7.
    // Change GPIO to GPIO port D.
    //
    // NOTE: Please also be sure to place the interrupt handler
    // in the vector-table
    //
    // ROM_SysCtlPeripheralEnable(SYSCTL_PERIPH_I2C7);
    // ROM_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOD);
    //
    ROM_SysCtlPeripheralEnable(SYSCTL_PERIPH_I2C8);
    ROM_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOA);

    //
    // Configure the pin muxing for I2C8 functions on port A2 and A3.
    // This step is not necessary if your part does not support pin muxing.
    //
    // NOTE: For BoosterPack 1 interface change these to PD1_I2C7SDA and
    // PD0_I2C7SCL.
    //
    // ROM_GPIOPinConfigure(GPIO_PD0_I2C7SCL);
    // ROM_GPIOPinConfigure(GPIO_PD1_I2C7SDA);
    //
    ROM_GPIOPinConfigure(GPIO_PA2_I2C8SCL);
    ROM_GPIOPinConfigure(GPIO_PA3_I2C8SDA);

    //
    // Select the I2C function for these pins.  This function will also
    // configure the GPIO pins pins for I2C operation, setting them to
    // open-drain operation with weak pull-ups.  Consult the data sheet
    // to see which functions are allocated per pin.
    //
    // NOTE: For BoosterPack 1 interface change these to PA2 (SCL) and
    // PA3 (SDA).
    //
    // GPIOPinTypeI2CSCL(GPIO_PORTD_BASE, GPIO_PIN_0);
    // ROM_GPIOPinTypeI2C(GPIO_PORTD_BASE, GPIO_PIN_1);
    // HWREG(GPIO_PORTD_AHB_BASE + GPIO_O_PUR) = 0x3;
    //
    GPIOPinTypeI2CSCL(GPIO_PORTA_BASE, GPIO_PIN_2);
    ROM_GPIOPinTypeI2C(GPIO_PORTA_BASE, GPIO_PIN_3);
    HWREG(GPIO_PORTA_AHB_BASE + GPIO_O_PUR) = 0xC;

    //
    // Enable interrupts to the processor.
    //
    ROM_IntMasterEnable();

    //
    // Initialize I2C7 peripheral.
    //
    // NOTE: For BoosterPack 1 change these to I2C7.
    //
    // I2CMInit(&g_sI2CInst, I2C7_BASE, INT_I2C7, 0xff, 0xff, g_ui32SysClock);
    I2CMInit(&g_sI2CInst, I2C8_BASE, INT_I2C8, 0xff, 0xff, g_ui32SysClock);

    //
    // Initialize the BQ27510G3.
    //
    BQ27510G3Init(&g_sBQ27510G3Inst, &g_sI2CInst, BQ27510G3_I2C_ADDRESS,
            BQ27510G3AppCallback, &g_sBQ27510G3Inst);

    //
    // Wait for initialization callback to indicate reset request is complete.
    //
    BQ27510G3AppI2CWait();

    //
    // Begin the data collection and printing.
    // Loop Forever.
    //
    while(1)
    {
        //
        // Infinite loop to process user commands from prompt
        //
        CheckForUserCommands();

    }
}
